[
  {
    "name": "Ayala Land Residences",
    "description": "A premium real estate website for the Philippines' largest property developer. I had the pleasure of helping build their website under 10up agency. Built with NextJS and integrated with Sanity.io CMS featuring Presentation mode for seamless content management. The site showcases Ayala's extensive portfolio of estates, residential brands, and properties with an elegant UI implemented using TailwindCSS and TypeScript. Features include property search, interactive galleries, and responsive design optimized for performance across all devices.",
    "featuredImage": "/images/websites/ayala-land-residences.jpg",
    "tags": ["NextJS", "TailwindCSS", "TypeScript", "Sanity.io"],
    "buttonText": "Visit Website",
    "link": "https://ayalaland.com/"
  },
  {
    "name": "American Business Bank",
    "description": "A sophisticated banking website for a US financial institution featuring secure, region-restricted access. Engineered with NextJS' App Router and TailwindCSS for exceptional performance and responsive design. Implemented a headless architecture with WordPress API backend, enabling the client to manage content through a familiar CMS while maintaining frontend performance. Established a robust CI/CD pipeline using GitHub Actions that automatically deploys updates, synchronizes with S3 storage, and maintains separate repositories for development and production—ensuring seamless content updates and consistent version control across environments.",
    "featuredImage": "/images/websites/americanbb-bank-new.jpg",
    "tags": ["NextJS", "TailwindCSS", "WP API", "Github CI/CD"],
    "buttonText": "Visit Website (Available for US only)",
    "link": "https://americanbb.bank/"
  },
  {
    "name": "Online Collaboration App",
    "description": "A real-time collaboration platform built with React and WebSocket technology. Features include live document editing, team chat functionality, comment threads and discussions, modern rich text editor interface, and seamless file sharing capabilities. Includes user authentication, role-based access control, and end-to-end encryption for secure collaboration.",
    "featuredImage": "/images/websites/online-collab-app-v2.jpg",
    "tags": [
      "React",
      "TypeScript",
      "WebSocket",
      "Liveblocks",
      "Sentry",
      "Clerk"
    ],
    "buttonText": "View Demo",
    "link": "https://online-collab-app.vercel.app/",
    "repository_link": "https://github.com/loq24/online-collab-app"
  },
  {
    "name": "Whipshots",
    "featuredImage": "/images/websites/whipshots.jpeg",
    "tags": ["NextJS", "Typescript", "SASS"],
    "description": "The website for the newly launched Starco product that is currently being promoted by Cardi B using NextJS, TypeScript, and SASS. There was a lot of pressure while developing this website since it was being promoted by a popular artist. However, I used this as motivation to deliver a website that exceeded expectations.",
    "link": "https://whipshots-website.vercel.app/"
  },
  {
    "name": "eCommerce Starter Kit",
    "featuredImage": "/images/websites/nextjs-sanity-ecommerce.jpg",
    "tags": ["NextJS", "Sanity.io", "Typescript", "TailwindCSS", "StripeAPI"],
    "description": "A Next.js E-commerce app integrated with Sanity.io. This is my personal project that is built with the TailwindCSS framework & SASS CSS extension. This is an E-commerce starter kit featuring seamless integration with the Stripe API.",
    "link": "https://nextjs-sanity-ecommerce-ecru.vercel.app/"
  }
]
