[
  {
    "name": "Delonghi TrueBrew",
    "featuredImage": "/images/websites/delonghi.jpg",
    "tags": ["NextJS", "GSAP", "Typescript", "SASS"],
    "description": "A website for the new product launch of Delonghi TrueBrew. The website is a single page application with numerous scroll-based animations, making it one of the most complex projects I've ever worked on. Since the website includes large images and many animations, I had to ensure that there were no performance issues and that the animations were smooth.",
    "link": "https://delonghitruebrew.com/"
  },
  {
    "name": "American Business Bank",
    "description": "Built with NextJS' App Router along with TailwindCSS. We've set up a WP API backend for this site. Additionally, I've implemented CI/CD with GitHub so that whenever someone commits an update to our GitHub repository, the site automatically rebuilds itself, syncs build files into an S3 bucket, and commits the build files into a separate repository that serves as the source for the production website. The GitHub action can also be triggered on the backend so that the site will be rebuilt with the latest backend content. The website is accessible only within the US.",
    "featuredImage": "/images/websites/americanbb-bank-new.jpg",
    "tags": ["NextJS", "TailwindCSS", "WP API", "Github CI/CD"],
    "buttonText": "Visit Website (Available for US only)",
    "link": "https://americanbb.bank/"
  },
  {
    "name": "WOO",
    "featuredImage": "/images/websites/thewoo.jpg",
    "tags": ["NextJS", "Headless WP", "GraphQL", "Typescript", "SASS"],
    "description": "Built with NextJS, TypeScript and SASS using Apollo Client in the frontend and implementing Incremental Static Regeneration building feature of NextJS. This is our company's website. The backend is built with a Headless WP using a WPGraphQL plugin. I'm in charge of the whole project from frontend to backend development. The site's assets are hosted in AWS S3 with CloudFront CDN.",
    "link": "https://woo-frontend.vercel.app/"
  },
  {
    "name": "Whipshots",
    "featuredImage": "/images/websites/whipshots.jpeg",
    "tags": ["NextJS", "Typescript", "SASS"],
    "description": "The website for the newly launched Starco product that is currently being promoted by Cardi B using NextJS, TypeScript, and SASS. There was a lot of pressure while developing this website since it was being promoted by a popular artist. However, I used this as motivation to deliver a website that exceeded expectations. Unfortunately, the website was updated to become a full-scale eCommerce website."
  },
  {
    "name": "eCommerce Starter Kit",
    "featuredImage": "/images/websites/nextjs-sanity-ecommerce.jpg",
    "tags": ["NextJS", "Sanity.io", "Typescript", "TailwindCSS", "StripeAPI"],
    "description": "A Next.js E-commerce app integrated with Sanity.io. This is my personal project that is built with the TailwindCSS framework & SASS CSS extension. This is an E-commerce starter kit featuring seamless integration with the Stripe API.",
    "link": "https://nextjs-sanity-ecommerce-loq24.vercel.app/"
  }
]
